Show / Hide Table of Contents
Class HangingAroundPatch
Representing of hanging hanging around patch load/support in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
HangingAroundPatch
Inherited Members
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Reinforcement))]
public class HangingAroundPatch : Reinforcement
Constructors
Improve this Doc   View Source
HangingAroundPatch()
Constructor
Declaration
public HangingAroundPatch()
Properties
Improve this Doc   View Source
BottomPartLength
Length of bottom part
Declaration
public double BottomPartLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Diameter
Diameter o reinforcement
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiameterOfMandrel
Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
Declaration
public double DiameterOfMandrel { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DistanceFromPatch
Distance from patch support/load
Declaration
public double DistanceFromPatch { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EndsType
End type of the reinforcement bar - same for both ends
Declaration
public LongReinfEndType EndsType { get; set; }
Property Value
 Type |  Description
 LongReinfEndType
Improve this Doc   View Source
InclinedPartsAngle
Inclination of inclined parts
Declaration
public double InclinedPartsAngle { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
InclinedPartsLength
Length of inclined parts
Declaration
public double InclinedPartsLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
IsMirrored
Add same reinforcement on oposide side (rotated 180°)
Declaration
public bool IsMirrored { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
LegsLength
Length of legs
Declaration
public double LegsLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MasterComponent
Master component of hanging
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
NumOfBarsInLayer
Number of bars in layer
Declaration
public int NumOfBarsInLayer { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Rotation
Angle of reinforcement rotation around patch point
Declaration
public double Rotation { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source